"""

Домашнее задание №1

Цикл while: ask_user со словарём

* Создайте словарь типа "вопрос": "ответ", например: 
  {"Как дела": "Хорошо!", "Что делаешь?": "Программирую"} и так далее
* Напишите функцию ask_user_dict() которая с помощью input() просит 
  пользователя ввести вопрос, а затем, если вопрос есть в словаре, 
  программа давала ему соотвествующий ответ. Например:

    Пользователь: Что делаешь?
    Программа: Программирую
    
"""

def ask_user_dict(user = input(), program, question, answer):
    program = input('Напишите ваш вопрос')
    while True:
        if question == user
    """
    Замените pass на ваш код
    """
    pass


question_answer_dict = {
'Как твои дела?': 'Хорошо',
'Какая сегодня погода?': 'Дождливая',
'Какой сегодня день недели?': 'Понедельник',
'Чем ты занят?': 'Программирую',
'Тебе нравится это?': 'Да',
}

if __name__ == "__main__":
    ask_user_dict()
